# Задача 1.3

# Создание списка месяцеы и количества дней

months = [
    ['январь', 31], ['февраль', 28 ], ['март', 31], ['апрель', 30],
    ['май',31 ], ['июнь', 30], ['июль', 31], ['август', 31],
    ['сентябрь', 30], ['октябрь', 31], ['ноябрь', 30], ['декабрь', 31]
    ]
a = int(input("Введите номер месяца: "))
if a <= 0 or a > 12:
    print ('Такого месяца нет!')
else:
    thing = 0
    for i in months:    
         if thing == a - 1:
            break
         else:
            thing += 1

    print(f'Вы ввели {months[thing][0]}. {months[thing][1]} дней')



